<template>
    <div class="filosofy">
        <h1>Trip&Freedom&Adventure</h1>
        <p>Разработка приложения *Trip&Freedom&Adventure* — это мой личный вклад в создание полезного продукта для общества. Несмотря на то, что эта работа не приносит мне финансовой выгоды, она имеет огромное значение для моего профессионального роста и развития. Я вижу свою миссию в создании инструмента, который поможет людям открывать новые горизонты, планировать путешествия и наслаждаться приключениями без лишних забот. Это приложение будет полезным не только для пользователей, но и для меня самого. Оно позволит мне углубить свои знания в области программирования, дизайна интерфейсов и разработки мобильных приложений. Кроме того, участие в таком проекте дает возможность проявить креативность и реализовать идеи, которые могут изменить жизнь людей к лучшему. Каждый день работы над этим приложением приближает меня к цели создания удобного и функционального продукта, который станет незаменимым помощником для путешественников. Это проект, который вдохновляет меня двигаться вперед, учиться новому и вносить свой вклад в развитие технологий и общества.</p>
    </div>
</template>

<style scoped>
.filosofy {
    background-color: #8B4513; /* коричневый цвет */
    height: fit-content;
    display: flex;
    flex-direction: column;
    align-items: center;
    filter: none;
    padding: 1rem;
    border-radius: 1rem;
    
}
</style>

<script>
export default {
    name: flosofy,
}
</script>