<template>
    <div class="container">
        <!-- Заголовок -->
        <h1>Trip & Freedom & Adventure</h1>

        <!-- Основной  контент -->
         <h3>Башҡортса</h3>
         <p>Trip&Freedom&Adventure приложениеһын булдырыу йәмғиәт өсөн файҙалы продукт булдырыуға индергән өлөш булып тора. Был эш профессиональ үҫештә һәм үҫешеүҙә мөһим ролде уйнай. Был ҡулланыу программаһының миссияһы — ҡулланусыларға яңы горизонттар аса, сәйәхәттәр планлаштырыу һәм мәшәҡәттәрһеҙ мауығыуҙар менән ҡылыҡһырлау ярҙамында. Был ҡулланыу программаһы ҡулланусыларға ла, шул иҫәптән миңә лә файҙа килтерәсәк, миңә программалаштырыу, интерфейс дизайны һәм мобиль ҡулланыу программаларын булдырыу буйынса белемдәремде камиллаштырырға мөмкинлек бирәсәк. Был проектта ҡатнашлыҡ шулай уҡ ижади ҡоласаларҙы күрһәтеү һәм кешеләрҙең тормош сифатын яҡшыртырға һәләтле идеяларҙы тормошҡа ашырыу мөмкинлеген бирә. Был ҡулланыу программаһы өҫтөндә көн һайын эшләү беҙҙе уңайлы һәм функциялы продукт булдырыуға яҡынайта, ул сәйәхәтселәр өсөн бик кәрәкле ҡоралға әйләнәсәк. Был проект даими алға барыу, яңы һәләттәрҙе өйрәнеү һәм технологияларҙың һәм йәмғиәттең үҫешенә индергән өлөштө күҙаллай.</p>
         <h3>На русском</h3>
        <p>Разработка приложения Trip&Freedom&Adventure представляет собой вклад в создание полезного продукта для общества. Данная работа играет важную роль в профессиональном росте и развитии. Миссия этого приложения заключается в помощи пользователям в открытии новых горизонтов, планировании путешествий и наслаждении приключениями без излишних хлопот. Приложение принесет пользу как пользователям, так и мне лично, позволяя углубить мои знания в программировании, дизайне интерфейсов и разработке мобильных приложений. Участие в этом проекте также предоставляет возможность проявить креативность и воплотить идеи, способные улучшить качество жизни людей. Ежедневная работа над приложением приближает нас к созданию удобного и функционального продукта, который станет незаменимым инструментом для путешественников. Этот проект вдохновляет на постоянное движение вперёд, обучение новым навыкам и внесение вклада в технологическое и общественное развитие.</p>
    </div>
</template>

<script setup lang="ts">
// Здесь может быть логика вашего компонента, если требуется
</script>

<style scoped>
.container {
    max-width: 800px;
    margin: 0 auto;
    padding: 20px;
}

h1 {
    text-align: center;
    font-size: 32px;
    margin-bottom: 30px;
}

p {
    line-height: 1.6;
    font-size: 18px;
}

.additional-content {
    margin-top: 40px;
}

@media screen and (max-width: 600px) {
    .container {
        padding: 10px;
    }

    h1 {
        font-size: 24px;
    }

    p {
        font-size: 16px;
    }
}
</style>